In [135]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
#3.2.1
table=Series({'a':30,'b':25,'c':27,'d':41,'e':25,'f':34})

In [136]:
newtable=Series([27],index=['g'])
table=table.append(newtable)

In [137]:
table['d']=40

In [138]:
table[table.values>27]

a    30
d    40
f    34
dtype: int64

In [139]:
newtable=table.drop(table.index[1:4])
newtable

a    30
e    25
f    34
g    27
dtype: int64

In [140]:
#3.2.2
newframe=DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['a','b','c'],columns=['one','two','three'])
newframe

   one  two  three
a    1    2      3
b    4    5      6
c    7    8      9

In [141]:
newframe[['two','three']]

   two  three
a    2      3
b    5      6
c    8      9

In [142]:
newframe.iloc[[0,2],[0,2]]

   one  three
a    1      3
c    7      9

In [143]:
data1=newframe.loc[newframe['two']>2].copy()#还有其他写法吗？
data1

   one  two  three
b    4    5      6
c    7    8      9

In [144]:
data1['four']=[10,10]
data1

   one  two  three  four
b    4    5      6    10
c    7    8      9    10

In [145]:
data1[data1>9]=8
data1

   one  two  three  four
b    4    5      6     8
c    7    8      9     8

In [146]:
data1.drop(['b','c'],axis=0)

Empty DataFrame
Columns: [one, two, three, four]
Index: []

In [147]:
#3.3.1
df=DataFrame(np.random.randint(10,100,size=(50,7)),columns=['a','b','c','d','e','f','g'])
df.to_csv('random1.csv',mode='w',header=True,index=False)

In [148]:
#3.3.2
dating=pd.read_csv('data\datingTestSet.csv',skiprows=[0,1],header=None)

In [149]:
dating.columns=['flymiles','videogame','icecream','type']

In [150]:
dating[0:5]

   flymiles  videogame  icecream        type
0   40920.0   8.326976  0.953952  largeDoses
1   14488.0   7.153469  1.673904  smallDoses
2   26052.0   1.441871  0.805124   didntLike
3   75136.0  13.147394  0.428964   didntLike
4   38344.0   1.669788  0.134296   didntLike

In [151]:
dating.loc[dating['type']=='largeDoses']

     flymiles  videogame  icecream        type
0     40920.0   8.326976  0.953952  largeDoses
6     35948.0   6.830792  1.213192  largeDoses
7     42666.0  13.276369  0.543880  largeDoses
9     35483.0  12.273169  1.508053  largeDoses
19    28488.0  10.528555  1.304844  largeDoses
..        ...        ...       ...         ...
977   34143.0  13.609528  0.364240  largeDoses
990   27750.0   8.546741  0.128706  largeDoses
997   26575.0  10.650102  0.866627  largeDoses
998   48111.0   9.134528  0.728045  largeDoses
999   43757.0   7.882601  1.332446  largeDoses

[327 rows x 4 columns]

In [152]:
dating.loc[dating['videogame']>10,'videogame']=10

In [153]:
#3.4.1
stuinfo=pd.read_excel('data\studentsinfo.xlsx','Group1',index_col=0)

In [154]:
stuinfo['案例教学']=np.NaN
stuinfo

        性别    年龄   身高    体重            省份    成绩    月生活费  课程兴趣  案例教学
序号
1     male  20.0  170  70.0      LiaoNing   NaN   800.0     5   NaN
2     male  22.0  180  71.0       GuangXi  77.0  1300.0     3   NaN
3     male   NaN  180  62.0        FuJian  57.0  1000.0     2   NaN
4     male  20.0  177  72.0      LiaoNing  79.0   900.0     4   NaN
5     male  20.0  172   NaN      ShanDong  91.0     NaN     5   NaN
6     male  20.0  179  75.0        YunNan  92.0   950.0     5   NaN
7   female  21.0  166  53.0      LiaoNing  80.0  1200.0     4   NaN
8   female  20.0  162  47.0         AnHui  78.0  1000.0     4   NaN
9   female  20.0  162  47.0         AnHui  78.0  1000.0     4   NaN
10    male  19.0  169  76.0  HeiLongJiang  88.0  1100.0     5   NaN

In [155]:
stuinfo.dropna(thresh=6)

        性别    年龄   身高    体重            省份    成绩    月生活费  课程兴趣  案例教学
序号
1     male  20.0  170  70.0      LiaoNing   NaN   800.0     5   NaN
2     male  22.0  180  71.0       GuangXi  77.0  1300.0     3   NaN
3     male   NaN  180  62.0        FuJian  57.0  1000.0     2   NaN
4     male  20.0  177  72.0      LiaoNing  79.0   900.0     4   NaN
5     male  20.0  172   NaN      ShanDong  91.0     NaN     5   NaN
6     male  20.0  179  75.0        YunNan  92.0   950.0     5   NaN
7   female  21.0  166  53.0      LiaoNing  80.0  1200.0     4   NaN
8   female  20.0  162  47.0         AnHui  78.0  1000.0     4   NaN
9   female  20.0  162  47.0         AnHui  78.0  1000.0     4   NaN
10    male  19.0  169  76.0  HeiLongJiang  88.0  1100.0     5   NaN

In [156]:
stuinfo.dropna(axis=1,how='all')

        性别    年龄   身高    体重            省份    成绩    月生活费  课程兴趣
序号
1     male  20.0  170  70.0      LiaoNing   NaN   800.0     5
2     male  22.0  180  71.0       GuangXi  77.0  1300.0     3
3     male   NaN  180  62.0        FuJian  57.0  1000.0     2
4     male  20.0  177  72.0      LiaoNing  79.0   900.0     4
5     male  20.0  172   NaN      ShanDong  91.0     NaN     5
6     male  20.0  179  75.0        YunNan  92.0   950.0     5
7   female  21.0  166  53.0      LiaoNing  80.0  1200.0     4
8   female  20.0  162  47.0         AnHui  78.0  1000.0     4
9   female  20.0  162  47.0         AnHui  78.0  1000.0     4
10    male  19.0  169  76.0  HeiLongJiang  88.0  1100.0     5

In [157]:
#3.4.2
stuinfo.fillna({'体重':stuinfo['体重'].mean(),'成绩':stuinfo['成绩'].mean()})

        性别    年龄   身高         体重            省份    成绩    月生活费  课程兴趣  案例教学
序号
1     male  20.0  170  70.000000      LiaoNing  80.0   800.0     5   NaN
2     male  22.0  180  71.000000       GuangXi  77.0  1300.0     3   NaN
3     male   NaN  180  62.000000        FuJian  57.0  1000.0     2   NaN
4     male  20.0  177  72.000000      LiaoNing  79.0   900.0     4   NaN
5     male  20.0  172  63.666667      ShanDong  91.0     NaN     5   NaN
6     male  20.0  179  75.000000        YunNan  92.0   950.0     5   NaN
7   female  21.0  166  53.000000      LiaoNing  80.0  1200.0     4   NaN
8   female  20.0  162  47.000000         AnHui  78.0  1000.0     4   NaN
9   female  20.0  162  47.000000         AnHui  78.0  1000.0     4   NaN
10    male  19.0  169  76.000000  HeiLongJiang  88.0  1100.0     5   NaN

In [158]:
stuinfo['年龄']=stuinfo['年龄'].fillna(method='ffill')
stuinfo

        性别    年龄   身高    体重            省份    成绩    月生活费  课程兴趣  案例教学
序号
1     male  20.0  170  70.0      LiaoNing   NaN   800.0     5   NaN
2     male  22.0  180  71.0       GuangXi  77.0  1300.0     3   NaN
3     male  22.0  180  62.0        FuJian  57.0  1000.0     2   NaN
4     male  20.0  177  72.0      LiaoNing  79.0   900.0     4   NaN
5     male  20.0  172   NaN      ShanDong  91.0     NaN     5   NaN
6     male  20.0  179  75.0        YunNan  92.0   950.0     5   NaN
7   female  21.0  166  53.0      LiaoNing  80.0  1200.0     4   NaN
8   female  20.0  162  47.0         AnHui  78.0  1000.0     4   NaN
9   female  20.0  162  47.0         AnHui  78.0  1000.0     4   NaN
10    male  19.0  169  76.0  HeiLongJiang  88.0  1100.0     5   NaN

In [159]:
stuinfo.fillna({'月生活费':stuinfo['月生活费'].median()})

        性别    年龄   身高    体重            省份    成绩    月生活费  课程兴趣  案例教学
序号
1     male  20.0  170  70.0      LiaoNing   NaN   800.0     5   NaN
2     male  22.0  180  71.0       GuangXi  77.0  1300.0     3   NaN
3     male  22.0  180  62.0        FuJian  57.0  1000.0     2   NaN
4     male  20.0  177  72.0      LiaoNing  79.0   900.0     4   NaN
5     male  20.0  172   NaN      ShanDong  91.0  1000.0     5   NaN
6     male  20.0  179  75.0        YunNan  92.0   950.0     5   NaN
7   female  21.0  166  53.0      LiaoNing  80.0  1200.0     4   NaN
8   female  20.0  162  47.0         AnHui  78.0  1000.0     4   NaN
9   female  20.0  162  47.0         AnHui  78.0  1000.0     4   NaN
10    male  19.0  169  76.0  HeiLongJiang  88.0  1100.0     5   NaN

In [160]:
#3.5.1
data1=pd.read_excel('data\studentsinfo.xlsx','Group3',index_col=0,usecols=['序号','性别','年龄'])

In [161]:
data2=pd.read_excel('data\studentsinfo.xlsx','Group3',index_col=0,usecols=['序号','身高','体重','成绩'])

In [162]:
data1=pd.merge(data1,data2,on='序号',how='inner')
data1

        性别  年龄   身高  体重  成绩
序号
21  female  21  165  45  93
22  female  19  167  42  89
23    male  21  169  80  93
24  female  21  160  49  59
25  female  21  162  54  68
26    male  21  181  77  62
27  female  21  162  49  65
28  female  22  160  52  73
29  female  20  161  51  80
30  female  20  168  52  98

In [163]:
#3.5.2
data1.sort_values(by='成绩',ascending=True)

        性别  年龄   身高  体重  成绩
序号
24  female  21  160  49  59
26    male  21  181  77  62
27  female  21  162  49  65
25  female  21  162  54  68
28  female  22  160  52  73
29  female  20  161  51  80
22  female  19  167  42  89
21  female  21  165  45  93
23    male  21  169  80  93
30  female  20  168  52  98

In [164]:
data1['身高排名']=data1['身高'].rank(method='min',ascending=False)
data1

        性别  年龄   身高  体重  成绩  身高排名
序号
21  female  21  165  45  93   5.0
22  female  19  167  42  89   4.0
23    male  21  169  80  93   2.0
24  female  21  160  49  59   9.0
25  female  21  162  54  68   6.0
26    male  21  181  77  62   1.0
27  female  21  162  49  65   6.0
28  female  22  160  52  73   9.0
29  female  20  161  51  80   8.0
30  female  20  168  52  98   3.0

In [165]:
#综合练习题
tplan=pd.read_excel('data\DataScience.xls',index_col=0)
tplan

,星期,节次,课程名称,实验项目名称,实验课时数,实验类型,班级,班级人数,二级实验室名称,实验地点门牌号
周次,,,,,,,,,,
2.0,1.0,5~7,数据结构,顺序表的基本操作,3.0,验证型,数据科学181,24.0,基础实验室,11-505
4.0,1.0,5~7,数据结构,链表的基本操作,3.0,验证型,数据科学181,24.0,基础实验室,11-505
6.0,1.0,5~7,数据结构,栈的基本运算,3.0,验证型,数据科学181,24.0,基础实验室,11-505
8.0,1.0,5~7,数据结构,二叉树的操作,3.0,验证型,数据科学181,24.0,基础实验室,11-505
10.0,1.0,5~7,数据结构,马踏棋盘问题,3.0,验证型,数据科学181,24.0,基础实验室,11-505
...,...,...,...,...,...,...,...,...,...,...
4.0,3.0,5-8,Python语言程序设计,字符串使用,4.0,验证型,大数据应用191,34.0,基础实验室,11-505
5.0,3.0,5-8,Python语言程序设计,函数与类设计,4.0,验证型,大数据应用191,34.0,基础实验室,11-505
6.0,3.0,5-8,Python语言程序设计,文件操作与异常处理,4.0,验证型,大数据应用191,34.0,基础实验室,11-505
7.0,3.0,5-8,Python语言程序设计,界面设计,4.0,验证型,大数据应用191,34.0,基础实验室,11-505
8.0,3.0,5-8,Python语言程序设计,综合程序设计,4.0,综合型,大数据应用191,34.0,基础实验室,11-505

In [166]:
pre=tplan[tplan.isna().any(axis=1)]
tplan.dropna()

,星期,节次,课程名称,实验项目名称,实验课时数,实验类型,班级,班级人数,二级实验室名称,实验地点门牌号
周次,,,,,,,,,,
2.0,1.0,5~7,数据结构,顺序表的基本操作,3.0,验证型,数据科学181,24.0,基础实验室,11-505
4.0,1.0,5~7,数据结构,链表的基本操作,3.0,验证型,数据科学181,24.0,基础实验室,11-505
6.0,1.0,5~7,数据结构,栈的基本运算,3.0,验证型,数据科学181,24.0,基础实验室,11-505
8.0,1.0,5~7,数据结构,二叉树的操作,3.0,验证型,数据科学181,24.0,基础实验室,11-505
10.0,1.0,5~7,数据结构,马踏棋盘问题,3.0,验证型,数据科学181,24.0,基础实验室,11-505
...,...,...,...,...,...,...,...,...,...,...
4.0,3.0,5-8,Python语言程序设计,字符串使用,4.0,验证型,大数据应用191,34.0,基础实验室,11-505
5.0,3.0,5-8,Python语言程序设计,函数与类设计,4.0,验证型,大数据应用191,34.0,基础实验室,11-505
6.0,3.0,5-8,Python语言程序设计,文件操作与异常处理,4.0,验证型,大数据应用191,34.0,基础实验室,11-505
7.0,3.0,5-8,Python语言程序设计,界面设计,4.0,验证型,大数据应用191,34.0,基础实验室,11-505
8.0,3.0,5-8,Python语言程序设计,综合程序设计,4.0,综合型,大数据应用191,34.0,基础实验室,11-505

In [167]:
pre.to_csv('pre.csv',mode='w',header=True,index=True,encoding='utf_8_sig')

In [168]:
tplan[['课程名称','实验项目名称','实验类型','二级实验室名称']]

              课程名称     实验项目名称 实验类型 二级实验室名称
周次
2.0           数据结构   顺序表的基本操作  验证型   基础实验室
4.0           数据结构    链表的基本操作  验证型   基础实验室
6.0           数据结构     栈的基本运算  验证型   基础实验室
8.0           数据结构     二叉树的操作  验证型   基础实验室
10.0          数据结构     马踏棋盘问题  验证型   基础实验室
...            ...        ...  ...     ...
4.0   Python语言程序设计      字符串使用  验证型   基础实验室
5.0   Python语言程序设计     函数与类设计  验证型   基础实验室
6.0   Python语言程序设计  文件操作与异常处理  验证型   基础实验室
7.0   Python语言程序设计       界面设计  验证型   基础实验室
8.0   Python语言程序设计     综合程序设计  综合型   基础实验室

[96 rows x 4 columns]

In [169]:
grouped=tplan.groupby(['课程名称'])
grouped.aggregate({'实验课时数':np.sum})

              实验课时数
课程名称
Python语言程序设计   64.0
商务数据分析         24.0
大数据技术          32.0
数据挖掘与机器学习      64.0
数据科学导论         45.0
数据结构           24.0

In [170]:
grouped=tplan.groupby(['周次','课程名称'])
grouped.aggregate({'实验课时数':np.sum})

                   实验课时数
周次   课程名称
1.0  Python语言程序设计    8.0
     大数据技术           2.0
     数据挖掘与机器学习       4.0
2.0  Python语言程序设计    8.0
     大数据技术           2.0
...                  ...
15.0 数据科学导论          6.0
16.0 大数据技术           2.0
     数据挖掘与机器学习       4.0
     数据科学导论          3.0
     数据结构            3.0

[62 rows x 1 columns]

In [171]:
pd.crosstab(tplan['课程名称'],tplan['实验类型'])

实验类型          实训  综合型  设计型  验证型
课程名称
Python语言程序设计   0    2    0   14
商务数据分析         6    0    0    0
大数据技术          0    3    7    6
数据挖掘与机器学习      0    2   10   20
数据科学导论         0    3    3    8
数据结构           0    0    0    8

In [172]:
tplan.sort_values(by=['班级','周次','星期','节次'],ascending=True)

,星期,节次,课程名称,实验项目名称,实验课时数,实验类型,班级,班级人数,二级实验室名称,实验地点门牌号
周次,,,,,,,,,,
1.0,4.0,3～4,大数据技术,Hadoop安装与HDFS使用,2.0,验证型,大数据应用171,38.0,数据科学实验室,11-309
2.0,3.0,7~8,数据挖掘与机器学习,树、规则,2.0,验证型,大数据应用171,25.0,人工智能实验室,11-305
2.0,4.0,3～4,大数据技术,MapReduce编程基础,2.0,验证型,大数据应用171,38.0,数据科学实验室,11-309
3.0,3.0,7~8,数据挖掘与机器学习,最佳回归系数,2.0,验证型,大数据应用171,25.0,人工智能实验室,11-305
3.0,4.0,3～4,大数据技术,HBase的使用,2.0,验证型,大数据应用171,38.0,数据科学实验室,11-309
...,...,...,...,...,...,...,...,...,...,...
6.0,2.0,1-4,Python语言程序设计,文件操作与异常处理,4.0,验证型,数据科学（卓越）191,30.0,基础实验室,11-505
7.0,2.0,1-4,Python语言程序设计,界面设计,4.0,验证型,数据科学（卓越）191,30.0,基础实验室,11-505
8.0,2.0,1-4,Python语言程序设计,综合程序设计,4.0,综合型,数据科学（卓越）191,30.0,基础实验室,11-505
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [173]:
grouped=tplan.groupby(['二级实验室名称'])
grouped.agg({'实验课时数':np.sum})

         实验课时数
二级实验室名称
人工智能实验室   62.0
基础实验室     88.0
数据科学实验室  104.0

In [186]:
type=tplan.groupby('二级实验室名称')['实验类型'].unique()
type

二级实验室名称
人工智能实验室             [验证型, 设计型, 综合型]
基础实验室                    [验证型, 综合型]
数据科学实验室    [验证型, 设计型, 综合型, 实训, nan]
Name: 实验类型, dtype: object